Catalogs/Предприятие.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.15">
	<Catalog>
		<Properties>
			<Name>Предприятие</Name>
			<Comment>Структура предприятия</Comment>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Холдер</Name>
					<Comment>Организация которой принадлежит рабочее место</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Холдеры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИсхКанал</Name>
					<Comment>Канал для внешних исходящих звонков</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ТелВнешние</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИсхЗапись</Name>
					<Comment>Состояние записи внешних исходящих звонков</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИсхЗапрет</Name>
					<Comment>Запрет или разрешение на выполнение внешних исходящих звонков</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Состояние</Name>
					<Comment>Состояние элемента</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.СостояниеЭлементаПредприятия</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Должность</Name>
					<Comment>Должность сотрудника</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГрафикРаботы</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ГрафикиРаботы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТочкаРазмещения</Name>
					<Comment>Точка размещения группы или подразделения</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ТочкиРазмещения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаименованиеПолное</Name>
					<Comment>Наименование элемента и его принадлежность</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>300</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АдресЭлектроннойПочты</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>128</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОповещатьОПропущенных</Name>
					<Comment>Оповещать о пропущенных звонках по эл.почте</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Руководитель</Name>
					<Comment>Текущий непосредтвенный руководитель</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Предприятие</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СотрудникОУ</Name>
					<Comment>Текущий сотрудник</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ОУ_Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Снилс</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>15</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаправлениеДеятельности</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>128</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>СотрудникиИстория</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Начало</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Окончание</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сотрудник</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ОУ_Сотрудники</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>РуководителиИстория</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ДатаНачала</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаОкончания</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Руководитель</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Предприятие</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ЦелевыеТочкиИстория</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ДатаНачала</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаОкончания</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЦелеваяТочка</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ТочкиЦелевые</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/Предприятие/Forms/ФормаГруппы/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ,СтандартнаяОбработка)

// Сформируем сведения о принадлежности элемента
//-------------------------------------------------------------------------------------------------
	Если (ЗначениеЗаполнено(Объект.Родитель)) Тогда
		Темп = "Точка размещения: " + СокрЛП(Объект.ТочкаРазмещения.Наименование);
		Темп = Темп + ", Родитель: " + СокрЛП(Объект.Родитель.Наименование);
		Элементы.НадписьПринадлежность.Заголовок = СокрЛП(Темп);
		Элементы.НадписьПринадлежность.Гиперссылка = Истина;
	Иначе
		Темп = СокрЛП(Объект.ТочкаРазмещения.Наименование);
		Элементы.НадписьПринадлежность.Заголовок = СокрЛП(Темп);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ТелефоныСформироватьНаСервере();
	ОбновлениеОтображения();
КонецПроцедуры

&НаКлиенте
Процедура ОбновлениеОтображения(Элемент = Неопределено)

// Сформируем заголовок для формы
//-------------------------------------------------------------------------------------------------
	Темп = ?(ЗначениеЗаполнено(Объект.Родитель),СокрЛП(Объект.Родитель) + ": ","");
	Темп = Темп + СокрЛП(Объект.Наименование);
	ЭтаФорма.Заголовок = СокрЛП(Темп);

// Доступность реквизитов отвечающих за внешние исходящие звонки
//-------------------------------------------------------------------------------------------------
	Доступно = (Объект.ИсхЗапрет = Ложь);
	Элементы.ГруппаИсходящиеНастройки.Видимость = Доступно;
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	Оповестить("Запись",Объект.Ссылка,ЭтаФорма);
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия,Параметр,Источник)
	ТелефоныСформировать(Неопределено);
КонецПроцедуры

//-------------------------------------------------------------------------------------------------

&НаКлиенте
Процедура НадписьПринадлежностьНажатие(Элемент)
	Попытка
		ОткрытьЗначение(Объект.Родитель);
	Исключение
	КонецПопытки;
КонецПроцедуры

//-------------------------------------------------------------------------------------------------

&НаКлиенте
Процедура ИсхЗапретПриИзменении(Элемент)
	Если (Объект.ИсхЗапрет = Истина) Тогда
		Объект.ИсхЗапись = Ложь;
	КонецЕсли;

	ОбновлениеОтображения();
КонецПроцедуры

&НаКлиенте
Процедура ИсхКаналПриИзменении(Элемент)
	Если (НЕ ЗначениеЗаполнено(Объект.ИсхКанал)) Тогда
		Объект.ИсхЗапрет = Истина;
		Объект.ИсхЗапись = Ложь;
	КонецЕсли;

	ОбновлениеОтображения();
КонецПроцедуры

//-------------------------------------------------------------------------------------------------

&НаКлиенте
Процедура ТелефоныСформировать(Команда)
	ТелефоныСформироватьНаСервере();
	ОбновлениеОтображения();
КонецПроцедуры

&НаСервере
Процедура ТелефоныСформироватьНаСервере()

// Проверим заполненность реквизитов
//-------------------------------------------------------------------------------------------------
	Доступно = ЗначениеЗаполнено(Объект.Ссылка);
	ЭтаФорма.Телефоны.Очистить();

	Если (Доступно = Ложь) Тогда
		Возврат;
	КонецЕсли;

// Получим все телефоны закрепленные за объектом
//-------------------------------------------------------------------------------------------------
	ТЗТемп = Телефония.ТелефоныВладельцаПолучить(Объект.Ссылка);

	Для Каждого ТекСтрока Из ТЗТемп Цикл
		НовСтрока = ЭтаФорма.Телефоны.Добавить();
		НовСтрока.Комментарий = СокрЛП(ТекСтрока.Комментарий);
		НовСтрока.Тип = СокрЛП(ТекСтрока.Тип);
		НовСтрока.Ссылка = ТекСтрока.Телефон;
		НовСтрока.Наименование = СокрЛП(ТекСтрока.Телефон);

// Получим сведения о наличии дополнительных опций на номере
//-------------------------------------------------------------------------------------------------
		Если (ВРег(СокрЛП(ТекСтрока.Тип)) = "ВНУТРЕННИЙ") Тогда
			СтрСостояние = Телефония.ТелВнутреннийСостояниеПолучить(ТекСтрока.Телефон);
			Доступно = (СтрСостояние <> Неопределено) И (ЗначениеЗаполнено(СтрСостояние.АбонСсылка));
			СписокОпций = ?(Доступно,СтрСостояние.АбонСсылка.additions,"");

			Если (ЗначениеЗаполнено(СписокОпций)) Тогда
				НовСтрока.Наименование = НовСтрока.Наименование + " (" + ВРег(СокрЛП(СписокОпций)) + ")";
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ТелефоныДобавить(Команда)

// Сформируем имя формы для выбора добавляемого объекта
//-------------------------------------------------------------------------------------------------
	Если (Команда.Имя = "ТелОчередьДобавить") Тогда
		ФормаВыбора = "ТелОчереди";
	ИначеЕсли (Команда.Имя = "ТелВнешнийДобавить") Тогда
		ФормаВыбора = "ТелВнешние";
	ИначеЕсли (Команда.Имя = "ТелМобильныйДобавить") Тогда
		ФормаВыбора = "ТелМобильные";
	Иначе
		ФормаВыбора = "ТелВнутренние";
	КонецЕсли;

// Откроем форму выбора
//-------------------------------------------------------------------------------------------------
	ФормаВыбора = "Справочник." + СокрЛП(ФормаВыбора) + ".ФормаВыбора";
	СтрПараметры = Новый Структура("ВыборСвободного",Истина);
	Результат = ОткрытьФормуМодально(ФормаВыбора,СтрПараметры);

	Если (Результат = Неопределено) Тогда
		Возврат;
	КонецЕсли;

// Если пользователь выбрал телефон
// Сохраним все изменения выполненные в объекте
// Назначим текущий объект владельцем для выбранного телефона
//-------------------------------------------------------------------------------------------------
	Если (ЭтаФорма.Записать() = Истина) Тогда
		Телефония.ВладелецНазначить(Результат,Объект.Ссылка);
		ТелефоныСформировать(Команда);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ТелефоныПередУдалением(Элемент,Отказ)

// В зависимости от типа удаляемого объекта
//-------------------------------------------------------------------------------------------------
	Если (Элемент.ТекущиеДанные <> Неопределено) Тогда
		Телефония.ВладелецОчистить(Элемент.ТекущиеДанные.Ссылка);
		ТелефоныСформировать(Неопределено);
	КонецЕсли;

	Отказ = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ТелефоныВыбор(Элемент,ВыбраннаяСтрока,Поле,СтандартнаяОбработка)
	Попытка
		ОткрытьЗначение(Элемент.ТекущиеДанные.Ссылка);
	Исключение
	КонецПопытки;

	СтандартнаяОбработка = Ложь;
КонецПроцедуры
